diplom-src/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>InformationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>ВКМ_Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ВремяНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ОписаниеОроблемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_ВыполненныеРаботы</name>
    <attributes>
      <name>ВКМ_ОписаниеРабот</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ФактическиПотраченоЧасов</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ЧасыКОплатеКлиенту</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/Documents/ВКМ_ОбслуживаниеКлиента/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
КонецПроцедуры 

&НаКлиенте
Процедура ВКМ_ВремяНачалаРаботПриИзменении(Элемент)
	
	НачалоПериода = Объект.ВКМ_ВремяНачалаРабот;
	КонецПериода = Объект.ВКМ_ВремяОкончанияРабот;
	
	Объект.ВКМ_Комментарий = ПолучитьРазностьДатВЧасах(НачалоПериода, КонецПериода);
	
КонецПроцедуры 

&НаКлиенте
Процедура ВКМ_ВремяОкончанияРаботПриИзменении(Элемент)
	
	НачалоПериода = Объект.ВКМ_ВремяНачалаРабот;
	КонецПериода = Объект.ВКМ_ВремяОкончанияРабот;
	
	Объект.ВКМ_Комментарий = ПолучитьРазностьДатВЧасах(НачалоПериода, КонецПериода);
	
КонецПроцедуры

#КонецОбласти 

#Область РазмещенияФункций

&НаКлиенте
Функция ПолучитьРазностьДатВЧасах(НачалоПериода, КонецПериода)
	
	РазностьВЧасах = (НачалоМинуты(КонецПериода) - НачалоМинуты(НачалоПериода)) /3600;
	
	КоличествоЧасов = Окр(РазностьВЧасах, 1, 0);
	
	СтрокаЧасовКОплате = "час(ов) к оплате";
	
	Возврат СтрШаблон("%1 %2", КоличествоЧасов, СтрокаЧасовКОплате);
	
КонецФункции

#КонецОбласти
